In [1]:
import os
import pandas as pd
from sqlalchemy import create_engine
from dotenv import load_dotenv

# Load environment variables from .env file
load_dotenv()

True

In [2]:
# Database connection details
DB_USER = os.getenv('POSTGRES_USER')
DB_PASSWORD = os.getenv('POSTGRES_PASSWORD')
DB_NAME = os.getenv('POSTGRES_DB')
DB_HOST = os.getenv('DB_HOST', 'localhost')  # Use 'localhost' if running Jupyter on the host machine
DB_PORT = os.getenv('DB_PORT', 5432)

# Create database engine
engine = create_engine(f'postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}')

In [3]:
query = """
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'public'
"""

# Execute the query and load the result into a DataFrame
df = pd.read_sql(query, engine)

# Display the DataFrame
df.head()

              table_name
0          business_info
1            names_table
2  business_name_history
3              addresses
4          company_forms

In [4]:
query = "SELECT * FROM business_info"

# Execute the query and load the result into a DataFrame
df = pd.read_sql(query, engine)

df.head()

,business_id,registration_date,eu_id,primary_name,main_business_line,status,end_date,last_modified,website
0,0150953-8,1978-03-15,FIFPRO.0150953-8,Geoanalyysi Oy,Civil engineering activities,Active,None,2024-11-15 17:23:08,unknown
1,0151464-4,1978-03-15,unknown,Markku J Takala Ky,Letting of other real estate,Active,None,2024-02-02 10:56:49,unknown
2,0151470-8,1978-03-15,unknown,Eero Kaski Kommandiittiyhtiö,CafÚs,Active,None,2024-04-03 09:11:46,unknown
3,0151481-2,1978-03-15,FIFPRO.0151481-2,Nokian Metallirakenne Oy,Manufacture of metal structures and parts of s...,Active,None,2024-11-12 18:31:14,unknown
4,0151484-7,1978-03-15,FIFPRO.0151484-7,Rounionkadun Teollisuushalli Oy,Letting of other real estate,Active,None,2024-02-02 10:51:06,unknown

In [5]:
query = "SELECT * FROM names_table"

# Execute the query and load the result into a DataFrame
df = pd.read_sql(query, engine)

# Display the DataFrame
df.head()

,id,business_id,name,type,registration_date,name_version,start_date,end_date,is_active
0,1,0150953-8,Geoanalyysi Oy,Business Name (Sole Trader),1976-10-22,1,None,None,True
1,2,0151464-4,Markku J Takala Ky,Business Name (Sole Trader),2016-12-21,1,None,None,True
2,3,0151464-4,Autosähköliike Markku Takala Ky,Business Name (Sole Trader),1993-03-03,2,None,2016-12-21,True
3,4,0151470-8,Eero Kaski Kommandiittiyhtiö,Business Name (Sole Trader),1974-06-07,1,None,None,True
4,5,0151481-2,Nokian Metallirakenne Oy,Business Name (Sole Trader),1996-09-03,1,None,None,True

In [7]:
query = "SELECT * FROM business_name_history"

# Execute the query and load the result into a DataFrame
df = pd.read_sql(query, engine)

# Display the DataFrame
df.head()

,business_id,previous_name,new_name,change_date
0,0151464-4,Autosähköliike Markku Takala Ky,Autosähköliike Markku Takala Ky,2016-12-21
1,0151481-2,Nokian Metallirakenne Ky,Nokian Metallirakenne Ky,1996-09-02
2,0151484-7,"Nokian Rakennuspelti, avoin yhtiö","Nokian Rakennuspelti, avoin yhtiö",1996-11-25
3,0151535-6,Nokian Hakan vuokratalot Oy,Nokian Hakan vuokratalot Oy,1982-06-16
4,0151608-4,As. Oy Alhonkallio,As. Oy Alhonkallio,1982-06-23

In [8]:
query = "SELECT * FROM company_forms_table"

# Execute the query and load the result into a DataFrame
df = pd.read_sql(query, engine)

# Display the DataFrame
df.head()

  business_id          description registration_date end_date
0   0150953-8      Limited company              None     None
1   0151464-4  Limited partnership              None     None
2   0151470-8  Limited partnership              None     None
3   0151481-2      Limited company        1996-09-03     None
4   0151484-7      Limited company        1996-11-26     None

In [9]:
query = "SELECT * FROM registered_entries_table"

# Execute the query and load the result into a DataFrame
df = pd.read_sql(query, engine)

# Display the DataFrame
df.head()

,business_id,description,registration_date,register,authority
0,3381556-4,Unregistered,2023-08-06,Trade Register,Patent and Registration Office
1,3381556-4,Registered,2023-08-18,Trade Register,Patent and Registration Office
2,3381556-4,Registered,2023-08-18,Basic Information from the Tax Administration,Tax Administration
3,3382714-3,Unregistered,2023-08-11,Trade Register,Patent and Registration Office
4,3382714-3,Registered,2023-08-24,Trade Register,Patent and Registration Office